#!/usr/bin/env python
# -*- encoding: utf-8 -*-
'''
@File     :   config.py
@Time     :   2025/06/15 09:54:53
@Author   :   yangff
@Version  :   1.0
@微信公众号 : 学点编程吧
'''

import os
import datetime
from db import StoryDB

db = StoryDB() # 数据库操作

current_dir = os.path.dirname(os.path.abspath(__file__)) # 当前目录

# 每次调用获取当前时间
def get_current_datetime():
    return datetime.datetime.now().strftime('%Y-%m-%d %H:%M:%S')

# 一些关键的视频
movieList = ['01.1.1.mp4', '02.1.1.mp4', '03.1.1.mp4', '04.1.1.mp4', '04.2.1.mp4', '04.3.1.mp4', '05.1.1.mp4', '06.1.1.mp4', '07.1.1.mp4', '08.1.1.mp4', 
'09.1.1.mp4', '10.1.1.mp4', '11.1.1.mp4', '12.1.1.mp4', '13.1.1.mp4', '14.1.1.mp4']

# 视频播放后提出疑问
branchDict = {'01.1.1.mp4':['苏小萌寻求你的帮助，你愿意帮助她吗？', '愿意帮助', '拒绝帮助'],
'01.1.1T.mp4':['苏小萌邀请你参加学校社团活动，你愿意参加吗？', '愿意参加', '拒绝参加'],
'01.1.1F.mp4':['苏小萌邀请你参加学校社团活动，你愿意参加吗？', '愿意参加', '拒绝参加'],
'02.1.1.mp4':['沈若曦的电脑出了问题，你愿意帮助她解决吗？', '试试吧', '我不会'],
'03.1.1.mp4':['沈若曦希望你能陪她加会班，你同意加班吗？', '同意加班', '拒绝加班'],
'04.3.1.mp4':['苏小萌想看看手机上的照片，要拿起手机仔细看吗？', '拿起手机', '不拿起手机'],
'05.1.1.mp4':['沈若曦希望你能假扮她的男朋友，你愿意吗？', '愿意假扮', '拒绝假扮'],
'06.1.1.mp4':['陆雨晴邀请你去马术俱乐部骑马，你愿意去吗？', '愿意去', '拒绝去'],
'07.1.1.mp4':['苏小萌似乎是想牵住你的手，你愿意牵手吗？', '愿意牵手', '拒绝牵手'],
'07.1.1T.mp4':['苏小萌哥哥邀请你周末来家吃饭，你愿意参加吗？', '去吃饭吧', '委婉拒绝'],
'07.1.1F.mp4':['苏小萌哥哥邀请你周末来家吃饭，你愿意参加吗？', '去吃饭吧', '委婉拒绝'],
'08.1.1.mp4':['沈若曦似乎心情很不好，你愿意倾听她的心声吗？', '愿意倾听', '拒绝倾听'],
'09.1.1.mp4':['苏小萌一家对你表示非常感谢，你愿意接受吗？', '坦然接受', '谦虚推辞'],
'10.1.1.mp4':['陆雨晴邀请你一起去爬山，你愿意去吗？', '愿意爬山', '拒绝爬山'],
'11.1.1.mp4':['陆雨晴询问你是否可以收起这个金色手镯，你觉得应该？', '拿走吧', '不拿走'],
'13.1.1.mp4':['此刻的你是否承认你就是曾经帮助过沈若曦的那个青年？', '承认', '不承认'],
'14.1.1.mp4':['此刻的你心情有些激动，愿意去集团公司吗？还是答应去和沈若曦谈？或者和苏小萌一家吃饭？', '去集团公司', '和沈若曦谈', '和苏小萌吃饭', '小孩子才做选择题，\n我都要']}

# 回答疑问后的下一个视频
choiceDict = {'愿意帮助':'01.1.1T.mp4', '拒绝帮助':'01.1.1F.mp4', '愿意参加':'01.1.2T.mp4', '拒绝参加':'01.1.2F.mp4', '试试吧':'02.1.1T.mp4', '我不会':'02.1.1F.mp4',
'同意加班':'03.1.1T.mp4', '拒绝加班':'03.1.1F.mp4','拿起手机':'04.3.1T.mp4', '不拿起手机':'04.3.1F.mp4', '愿意假扮':'05.1.1T.mp4', '拒绝假扮':'05.1.1F.mp4',
'愿意去':'06.1.1T.mp4', '拒绝去':'06.1.1F.mp4', '愿意牵手':'07.1.1T.mp4', '拒绝牵手':'07.1.1F.mp4', '去吃饭吧':'07.2.1T.mp4', '委婉拒绝':'07.2.1F.mp4',
'愿意倾听':'08.1.1T.mp4', '拒绝倾听':'08.1.1F.mp4', '坦然接受':'09.1.1T.mp4', '谦虚推辞':'09.1.1F.mp4', '愿意爬山':'10.1.1T.mp4', '拒绝爬山':'10.1.1F.mp4',
'拿走吧':'11.1.1T.mp4', '不拿走':'11.1.1F.mp4', '承认':'13.1.1T.mp4', '不承认':'13.1.1F.mp4', '去集团公司':'14.2.1.mp4', '和沈若曦谈':'14.2.2.mp4', 
'和苏小萌吃饭':'14.2.3.mp4', '小孩子才做选择题，\n我都要':'14.2.4.mp4'}

# 每个视频对应的好感度
favorabilityDict = {'愿意帮助':['苏小萌', 10], '拒绝帮助':['苏小萌', -5], '愿意参加':['苏小萌', 10], '拒绝参加':['苏小萌', -5], '试试吧':['沈若曦', 10], '我不会':['沈若曦', -5],
'同意加班':['沈若曦', 10], '拒绝加班':['沈若曦', -5],'拿起手机':['苏小萌', 10], '不拿起手机':['苏小萌', 5], '愿意假扮':['沈若曦', 10], '拒绝假扮':['沈若曦', -10],
'愿意去':['陆雨晴', 10], '拒绝去':['陆雨晴', -5], '愿意牵手':['苏小萌', 10], '拒绝牵手':['苏小萌', 5], '去吃饭吧':['苏小萌', 10], '委婉拒绝':['苏小萌', -5],
'愿意倾听':['沈若曦', 30], '拒绝倾听':['沈若曦', -10], '坦然接受':['苏小萌', 20], '谦虚推辞':['苏小萌', 10], '愿意爬山':['陆雨晴', 5], '拒绝爬山':['陆雨晴', -5],
'拿走吧':['陆雨晴', -10], '不拿走':['陆雨晴', 10], '承认':['沈若曦', 20], '不承认':['沈若曦', -5], '去集团公司':['陆雨晴', 10], '和沈若曦谈':['沈若曦', 10], 
'和苏小萌吃饭':['苏小萌', 10], '小孩子才做选择题，\n我都要':['all', 10], '04.1.1.mp4':['苏小萌', 10], '04.2.1.mp4':['苏小萌', 10], '05.1.1T.mp4':['沈若曦', 10], 
'06.1.1.mp4':['陆雨晴', 15], '06.1.1T.mp4':['陆雨晴', 10], '11.1.1.mp4':['陆雨晴', 30], '12.1.1.mp4':['陆雨晴', 10]}

def fullname(movieName, flag):
    '''
    获得影片的完整路径
    '''
    if flag == 0:
        return current_dir + "/res/bgm/" + movieName
    if flag == 1:
        return current_dir + "/res/videos/" + movieName
    if flag == 2:
        return current_dir + "/res/videos/achievement/" + movieName

def defullname(fullmovieName):
    '''
    将影片的完整路径分解，只要具体的文件名
    '''
    return fullmovieName.split('/')[-1]




